Autodesk.Revit.DB.DetailElementOrderUtils.AreDetailElements(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Indicates whether the given elements are all detail elements.
pDocument:
The document.
pDBView:
The view.
detailElementIds:
The set of detail elementIds to check.
Returns:
True if it is a set of detail elements, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DetailElementOrderUtils.SendBackward(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Moves the given detail instances one step closer to the back with relation to all other detail
instances in the view, while keeping the order of the given ones.
pDocument:
The document.
pDBView:
The view.
detailElementIds:
The set of the detail elementIds to move backward.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The set detailElementIds contains one or more non-detail element Ids.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DetailElementOrderUtils.SendToBack(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Places the given detail instances behind all other detail instances in the view, while keeping
the order of the given ones.
pDocument:
The document.
pDBView:
The view.
detailElementIds:
The set of the detail elementIds to send to back.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The set detailElementIds contains one or more non-detail element Ids.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DetailElementOrderUtils.BringForward(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Moves the given detail instances one step closer to the front of all other detail instances in the view,
while keeping the order of the given ones.
pDocument:
The document.
pDBView:
The view.
detailElementIds:
The set of detail elementIds to bring forward.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The set detailElementIds contains one or more non-detail element Ids.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DetailElementOrderUtils.BringToFront(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Places the given detail instances in the front of all other detail instances in the view, while
keeping the order of the given ones.
pDocument:
The document.
pDBView:
The view.
detailElementIds:
The set of detail elementIds to bring to front.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The set detailElementIds contains one or more non-detail element Ids.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014